Autodesk.Revit.DB.FamilySymbol.SetStructuralSection(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection)
Sets the structural section in element.
Remarks:
Only beams, braces and structural columns can have a structural section.
To check if the element can have structural section use the Family.HasStructuralSection() method.
structuralSection:
Structural section with values that will be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FamilySymbol cannot have a structural section.
Since:
2015